app/controllers/stack_items_controller.rb

  def index
    @stack_items = StackItem.all(:order => 'created_at DESC')
---
SELECT "stack_items".* FROM "stack_items" ORDER BY created_at, DESC

  def show
    @stack_item = StackItem.find(params[:id])
---
SELECT "stack_items".* FROM "stack_items" WHERE "stack_items"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @stack_item = StackItem.new
    @stack_items = StackItem.all(:order => 'created_at DESC')
---
SELECT "stack_items".* FROM "stack_items" ORDER BY created_at DESC

  def edit
    @stack_item = StackItem.find(params[:id])
---
SELECT "stack_items".* FROM "stack_items" WHERE "stack_items"."id" = ? LIMIT 1  [["id", "8"]]

  def create
    @stack_item = StackItem.new(params[:stack_item])

    respond_to do |format|
      if @stack_item.save
---
INSERT INTO "stack_items" ("created_at", "item_name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 14 May 2012 19:42:39 UTC +00:00], ["item_name", "first item"], ["updated_at", Mon, 14 May 2012 19:42:39 UTC +00:00]]

  def destroy
    @stack_item = StackItem.find(params[:id])
    @stack_item.destroy
---
SELECT "stack_items".* FROM "stack_items" WHERE "stack_items"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "stack_items" WHERE "stack_items"."id" = ?  [["id", 3]]